; domain
(define (domain sokoban)
  (:requirements :typing :action-costs)
  (:types thing location direction - object
          player stone - thing)
  (:predicates (clear ?l - location)
	       (at ?t - thing ?l - location)
	       (at-goal ?s - stone)
	       (IS-GOAL ?l - location)
	       (IS-NONGOAL ?l - location)
               (MOVE-DIR ?from ?to - location ?dir - direction))
  

  (:action move
   :parameters (?p - player ?from ?to - location ?dir - direction)
   :precondition (and (at ?p ?from)
                      (clear ?to)
                      (MOVE-DIR ?from ?to ?dir)
                      )
   :effect       (and (not (at ?p ?from))
                      (not (clear ?to))
                      (at ?p ?to)
                      (clear ?from)
                      )
   )

  (:action push-to-nongoal
   :parameters (?p - player ?s - stone
                ?ppos ?from ?to - location
                ?dir - direction)
   :precondition (and (at ?p ?ppos)
                      (at ?s ?from)
                      (clear ?to)
                      (MOVE-DIR ?ppos ?from ?dir)
                      (MOVE-DIR ?from ?to ?dir)
                      (IS-NONGOAL ?to)
                      )
   :effect       (and (not (at ?p ?ppos))
                      (not (at ?s ?from))
                      (not (clear ?to))
                      (at ?p ?from)
                      (at ?s ?to)
                      (clear ?ppos)
                      (not (at-goal ?s))
                      )
   )

  (:action push-to-goal
   :parameters (?p - player ?s - stone
                ?ppos ?from ?to - location
                ?dir - direction)
   :precondition (and (at ?p ?ppos)
                      (at ?s ?from)
                      (clear ?to)
                      (MOVE-DIR ?ppos ?from ?dir)
                      (MOVE-DIR ?from ?to ?dir)
                      (IS-GOAL ?to)
                      )
   :effect       (and (not (at ?p ?ppos))
                      (not (at ?s ?from))
                      (not (clear ?to))
                      (at ?p ?from)
                      (at ?s ?to)
                      (clear ?ppos)
                      (at-goal ?s)
                      )
   )
)

; problem
;; "svenx022"
;;
;;   # # # # # # # # # #
;;  # @ @ @ # @ # @ @ @ #
;;   # $ # * * * * # $ #
;;  # @ * @ @ # @ @ * @ #
;;   # # @ @ . . @ @ # #
;;      # # # # # # #

(define (problem p022-hexoban-temporal)
  (:domain sokoban)
  (:objects
    dir-east - direction
    dir-northeast - direction
    dir-northwest - direction
    dir-southeast - direction
    dir-southwest - direction
    dir-west - direction
    player-01 - player
    player-02 - player
    player-03 - player
    player-04 - player
    player-05 - player
    player-06 - player
    player-07 - player
    player-08 - player
    player-09 - player
    player-10 - player
    player-11 - player
    player-12 - player
    player-13 - player
    player-14 - player
    player-15 - player
    player-16 - player
    player-17 - player
    pos-01-01 - location
    pos-01-03 - location
    pos-01-05 - location
    pos-02-02 - location
    pos-02-04 - location
    pos-02-06 - location
    pos-03-01 - location
    pos-03-03 - location
    pos-03-05 - location
    pos-04-02 - location
    pos-04-04 - location
    pos-04-06 - location
    pos-05-01 - location
    pos-05-03 - location
    pos-05-05 - location
    pos-06-02 - location
    pos-06-04 - location
    pos-06-06 - location
    pos-07-01 - location
    pos-07-03 - location
    pos-07-05 - location
    pos-08-02 - location
    pos-08-04 - location
    pos-08-06 - location
    pos-09-01 - location
    pos-09-03 - location
    pos-09-05 - location
    pos-10-02 - location
    pos-10-04 - location
    pos-10-06 - location
    pos-11-01 - location
    pos-11-03 - location
    pos-11-05 - location
    pos-12-02 - location
    pos-12-04 - location
    pos-12-06 - location
    pos-13-01 - location
    pos-13-03 - location
    pos-13-05 - location
    pos-14-02 - location
    pos-14-04 - location
    pos-14-06 - location
    pos-15-01 - location
    pos-15-03 - location
    pos-15-05 - location
    pos-16-02 - location
    pos-16-04 - location
    pos-16-06 - location
    pos-17-01 - location
    pos-17-03 - location
    pos-17-05 - location
    pos-18-02 - location
    pos-18-04 - location
    pos-18-06 - location
    pos-19-01 - location
    pos-19-03 - location
    pos-19-05 - location
    pos-20-02 - location
    pos-20-04 - location
    pos-20-06 - location
    pos-21-01 - location
    pos-21-03 - location
    pos-21-05 - location
    pos-22-02 - location
    pos-22-04 - location
    pos-22-06 - location
    stone-01 - stone
    stone-02 - stone
    stone-03 - stone
    stone-04 - stone
    stone-05 - stone
    stone-06 - stone
    stone-07 - stone
    stone-08 - stone
  )
  (:init
    (IS-GOAL pos-06-04)
    (IS-GOAL pos-09-03)
    (IS-GOAL pos-11-03)
    (IS-GOAL pos-11-05)
    (IS-GOAL pos-13-03)
    (IS-GOAL pos-13-05)
    (IS-GOAL pos-15-03)
    (IS-GOAL pos-18-04)
    (IS-NONGOAL pos-01-01)
    (IS-NONGOAL pos-01-03)
    (IS-NONGOAL pos-01-05)
    (IS-NONGOAL pos-02-02)
    (IS-NONGOAL pos-02-04)
    (IS-NONGOAL pos-02-06)
    (IS-NONGOAL pos-03-01)
    (IS-NONGOAL pos-03-03)
    (IS-NONGOAL pos-03-05)
    (IS-NONGOAL pos-04-02)
    (IS-NONGOAL pos-04-04)
    (IS-NONGOAL pos-04-06)
    (IS-NONGOAL pos-05-01)
    (IS-NONGOAL pos-05-03)
    (IS-NONGOAL pos-05-05)
    (IS-NONGOAL pos-06-02)
    (IS-NONGOAL pos-06-06)
    (IS-NONGOAL pos-07-01)
    (IS-NONGOAL pos-07-03)
    (IS-NONGOAL pos-07-05)
    (IS-NONGOAL pos-08-02)
    (IS-NONGOAL pos-08-04)
    (IS-NONGOAL pos-08-06)
    (IS-NONGOAL pos-09-01)
    (IS-NONGOAL pos-09-05)
    (IS-NONGOAL pos-10-02)
    (IS-NONGOAL pos-10-04)
    (IS-NONGOAL pos-10-06)
    (IS-NONGOAL pos-11-01)
    (IS-NONGOAL pos-12-02)
    (IS-NONGOAL pos-12-04)
    (IS-NONGOAL pos-12-06)
    (IS-NONGOAL pos-13-01)
    (IS-NONGOAL pos-14-02)
    (IS-NONGOAL pos-14-04)
    (IS-NONGOAL pos-14-06)
    (IS-NONGOAL pos-15-01)
    (IS-NONGOAL pos-15-05)
    (IS-NONGOAL pos-16-02)
    (IS-NONGOAL pos-16-04)
    (IS-NONGOAL pos-16-06)
    (IS-NONGOAL pos-17-01)
    (IS-NONGOAL pos-17-03)
    (IS-NONGOAL pos-17-05)
    (IS-NONGOAL pos-18-02)
    (IS-NONGOAL pos-18-06)
    (IS-NONGOAL pos-19-01)
    (IS-NONGOAL pos-19-03)
    (IS-NONGOAL pos-19-05)
    (IS-NONGOAL pos-20-02)
    (IS-NONGOAL pos-20-04)
    (IS-NONGOAL pos-20-06)
    (IS-NONGOAL pos-21-01)
    (IS-NONGOAL pos-21-03)
    (IS-NONGOAL pos-21-05)
    (IS-NONGOAL pos-22-02)
    (IS-NONGOAL pos-22-04)
    (IS-NONGOAL pos-22-06)
    (MOVE-DIR pos-01-05 pos-02-06 dir-southeast)
    (MOVE-DIR pos-02-06 pos-01-05 dir-northwest)
    (MOVE-DIR pos-02-06 pos-04-06 dir-east)
    (MOVE-DIR pos-04-02 pos-05-03 dir-southeast)
    (MOVE-DIR pos-04-02 pos-06-02 dir-east)
    (MOVE-DIR pos-04-04 pos-05-03 dir-northeast)
    (MOVE-DIR pos-04-04 pos-06-04 dir-east)
    (MOVE-DIR pos-04-06 pos-02-06 dir-west)
    (MOVE-DIR pos-05-03 pos-04-02 dir-northwest)
    (MOVE-DIR pos-05-03 pos-04-04 dir-southwest)
    (MOVE-DIR pos-05-03 pos-06-02 dir-northeast)
    (MOVE-DIR pos-05-03 pos-06-04 dir-southeast)
    (MOVE-DIR pos-06-02 pos-04-02 dir-west)
    (MOVE-DIR pos-06-02 pos-05-03 dir-southwest)
    (MOVE-DIR pos-06-02 pos-08-02 dir-east)
    (MOVE-DIR pos-06-04 pos-04-04 dir-west)
    (MOVE-DIR pos-06-04 pos-05-03 dir-northwest)
    (MOVE-DIR pos-06-04 pos-07-05 dir-southeast)
    (MOVE-DIR pos-06-04 pos-08-04 dir-east)
    (MOVE-DIR pos-07-05 pos-06-04 dir-northwest)
    (MOVE-DIR pos-07-05 pos-08-04 dir-northeast)
    (MOVE-DIR pos-07-05 pos-09-05 dir-east)
    (MOVE-DIR pos-08-02 pos-06-02 dir-west)
    (MOVE-DIR pos-08-02 pos-09-03 dir-southeast)
    (MOVE-DIR pos-08-04 pos-06-04 dir-west)
    (MOVE-DIR pos-08-04 pos-07-05 dir-southwest)
    (MOVE-DIR pos-08-04 pos-09-03 dir-northeast)
    (MOVE-DIR pos-08-04 pos-09-05 dir-southeast)
    (MOVE-DIR pos-08-04 pos-10-04 dir-east)
    (MOVE-DIR pos-09-03 pos-08-02 dir-northwest)
    (MOVE-DIR pos-09-03 pos-08-04 dir-southwest)
    (MOVE-DIR pos-09-03 pos-10-04 dir-southeast)
    (MOVE-DIR pos-09-03 pos-11-03 dir-east)
    (MOVE-DIR pos-09-05 pos-07-05 dir-west)
    (MOVE-DIR pos-09-05 pos-08-04 dir-northwest)
    (MOVE-DIR pos-09-05 pos-10-04 dir-northeast)
    (MOVE-DIR pos-09-05 pos-11-05 dir-east)
    (MOVE-DIR pos-10-04 pos-08-04 dir-west)
    (MOVE-DIR pos-10-04 pos-09-03 dir-northwest)
    (MOVE-DIR pos-10-04 pos-09-05 dir-southwest)
    (MOVE-DIR pos-10-04 pos-11-03 dir-northeast)
    (MOVE-DIR pos-10-04 pos-11-05 dir-southeast)
    (MOVE-DIR pos-11-03 pos-09-03 dir-west)
    (MOVE-DIR pos-11-03 pos-10-04 dir-southwest)
    (MOVE-DIR pos-11-03 pos-12-02 dir-northeast)
    (MOVE-DIR pos-11-03 pos-13-03 dir-east)
    (MOVE-DIR pos-11-05 pos-09-05 dir-west)
    (MOVE-DIR pos-11-05 pos-10-04 dir-northwest)
    (MOVE-DIR pos-11-05 pos-13-05 dir-east)
    (MOVE-DIR pos-12-02 pos-11-03 dir-southwest)
    (MOVE-DIR pos-12-02 pos-13-03 dir-southeast)
    (MOVE-DIR pos-13-03 pos-11-03 dir-west)
    (MOVE-DIR pos-13-03 pos-12-02 dir-northwest)
    (MOVE-DIR pos-13-03 pos-14-04 dir-southeast)
    (MOVE-DIR pos-13-03 pos-15-03 dir-east)
    (MOVE-DIR pos-13-05 pos-11-05 dir-west)
    (MOVE-DIR pos-13-05 pos-14-04 dir-northeast)
    (MOVE-DIR pos-13-05 pos-15-05 dir-east)
    (MOVE-DIR pos-14-04 pos-13-03 dir-northwest)
    (MOVE-DIR pos-14-04 pos-13-05 dir-southwest)
    (MOVE-DIR pos-14-04 pos-15-03 dir-northeast)
    (MOVE-DIR pos-14-04 pos-15-05 dir-southeast)
    (MOVE-DIR pos-14-04 pos-16-04 dir-east)
    (MOVE-DIR pos-15-03 pos-13-03 dir-west)
    (MOVE-DIR pos-15-03 pos-14-04 dir-southwest)
    (MOVE-DIR pos-15-03 pos-16-02 dir-northeast)
    (MOVE-DIR pos-15-03 pos-16-04 dir-southeast)
    (MOVE-DIR pos-15-05 pos-13-05 dir-west)
    (MOVE-DIR pos-15-05 pos-14-04 dir-northwest)
    (MOVE-DIR pos-15-05 pos-16-04 dir-northeast)
    (MOVE-DIR pos-15-05 pos-17-05 dir-east)
    (MOVE-DIR pos-16-02 pos-15-03 dir-southwest)
    (MOVE-DIR pos-16-02 pos-18-02 dir-east)
    (MOVE-DIR pos-16-04 pos-14-04 dir-west)
    (MOVE-DIR pos-16-04 pos-15-03 dir-northwest)
    (MOVE-DIR pos-16-04 pos-15-05 dir-southwest)
    (MOVE-DIR pos-16-04 pos-17-05 dir-southeast)
    (MOVE-DIR pos-16-04 pos-18-04 dir-east)
    (MOVE-DIR pos-17-05 pos-15-05 dir-west)
    (MOVE-DIR pos-17-05 pos-16-04 dir-northwest)
    (MOVE-DIR pos-17-05 pos-18-04 dir-northeast)
    (MOVE-DIR pos-18-02 pos-16-02 dir-west)
    (MOVE-DIR pos-18-02 pos-19-03 dir-southeast)
    (MOVE-DIR pos-18-02 pos-20-02 dir-east)
    (MOVE-DIR pos-18-04 pos-16-04 dir-west)
    (MOVE-DIR pos-18-04 pos-17-05 dir-southwest)
    (MOVE-DIR pos-18-04 pos-19-03 dir-northeast)
    (MOVE-DIR pos-18-04 pos-20-04 dir-east)
    (MOVE-DIR pos-19-03 pos-18-02 dir-northwest)
    (MOVE-DIR pos-19-03 pos-18-04 dir-southwest)
    (MOVE-DIR pos-19-03 pos-20-02 dir-northeast)
    (MOVE-DIR pos-19-03 pos-20-04 dir-southeast)
    (MOVE-DIR pos-20-02 pos-18-02 dir-west)
    (MOVE-DIR pos-20-02 pos-19-03 dir-southwest)
    (MOVE-DIR pos-20-04 pos-18-04 dir-west)
    (MOVE-DIR pos-20-04 pos-19-03 dir-northwest)
    (MOVE-DIR pos-20-06 pos-22-06 dir-east)
    (MOVE-DIR pos-22-06 pos-20-06 dir-west)
    (at player-01 pos-04-02)
    (at player-02 pos-06-02)
    (at player-03 pos-08-02)
    (at player-04 pos-12-02)
    (at player-05 pos-16-02)
    (at player-06 pos-18-02)
    (at player-07 pos-20-02)
    (at player-08 pos-04-04)
    (at player-09 pos-08-04)
    (at player-10 pos-10-04)
    (at player-11 pos-14-04)
    (at player-12 pos-16-04)
    (at player-13 pos-20-04)
    (at player-14 pos-07-05)
    (at player-15 pos-09-05)
    (at player-16 pos-15-05)
    (at player-17 pos-17-05)
    (at stone-01 pos-05-03)
    (at stone-02 pos-09-03)
    (at stone-03 pos-11-03)
    (at stone-04 pos-13-03)
    (at stone-05 pos-15-03)
    (at stone-06 pos-19-03)
    (at stone-07 pos-06-04)
    (at stone-08 pos-18-04)
    (at-goal stone-02)
    (at-goal stone-03)
    (at-goal stone-04)
    (at-goal stone-05)
    (at-goal stone-07)
    (at-goal stone-08)
    (clear pos-01-01)
    (clear pos-01-03)
    (clear pos-01-05)
    (clear pos-02-06)
    (clear pos-04-06)
    (clear pos-11-05)
    (clear pos-13-05)
    (clear pos-20-06)
    (clear pos-22-06)
  )
  (:goal (and
    (at-goal stone-01)
    (at-goal stone-02)
    (at-goal stone-03)
    (at-goal stone-04)
    (at-goal stone-05)
    (at-goal stone-06)
    (at-goal stone-07)
    (at-goal stone-08)
  ))
  (:metric minimize (total-time))
)

; plan
1. (move player-10 pos-10-04 pos-11-05 dir-southeast)
   deleted: (at player-10 pos-10-04) (clear pos-11-05)
   added: (at player-10 pos-11-05) (clear pos-10-04)
   goals met: 6 of 8
2. (move player-09 pos-08-04 pos-10-04 dir-east)
   deleted: (at player-09 pos-08-04) (clear pos-10-04)
   added: (at player-09 pos-10-04) (clear pos-08-04)
   goals met: 6 of 8
3. (move player-11 pos-14-04 pos-13-05 dir-southwest)
   deleted: (at player-11 pos-14-04) (clear pos-13-05)
   added: (at player-11 pos-13-05) (clear pos-14-04)
   goals met: 6 of 8
4. (move player-12 pos-16-04 pos-14-04 dir-west)
   deleted: (at player-12 pos-16-04) (clear pos-14-04)
   added: (at player-12 pos-14-04) (clear pos-16-04)
   goals met: 6 of 8
5. (push-to-nongoal player-08 stone-07 pos-04-04 pos-06-04 pos-08-04 dir-east)
   deleted: (at player-08 pos-04-04) (at stone-07 pos-06-04) (clear pos-08-04) (at-goal stone-07)
   added: (at player-08 pos-06-04) (at stone-07 pos-08-04) (clear pos-04-04)
   goals met: 5 of 8
6. (move player-08 pos-06-04 pos-04-04 dir-west)
   deleted: (at player-08 pos-06-04) (clear pos-04-04)
   added: (at player-08 pos-04-04) (clear pos-06-04)
   goals met: 5 of 8
7. (push-to-nongoal player-13 stone-08 pos-20-04 pos-18-04 pos-16-04 dir-west)
   deleted: (at player-13 pos-20-04) (at stone-08 pos-18-04) (clear pos-16-04) (at-goal stone-08)
   added: (at player-13 pos-18-04) (at stone-08 pos-16-04) (clear pos-20-04)
   goals met: 4 of 8
8. (move player-13 pos-18-04 pos-20-04 dir-east)
   deleted: (at player-13 pos-18-04) (clear pos-20-04)
   added: (at player-13 pos-20-04) (clear pos-18-04)
   goals met: 4 of 8
9. (push-to-goal player-01 stone-01 pos-04-02 pos-05-03 pos-06-04 dir-southeast)
   deleted: (at player-01 pos-04-02) (at stone-01 pos-05-03) (clear pos-06-04)
   added: (at player-01 pos-05-03) (at stone-01 pos-06-04) (clear pos-04-02) (at-goal stone-01)
   goals met: 5 of 8
10. (push-to-goal player-07 stone-06 pos-20-02 pos-19-03 pos-18-04 dir-southwest)
   deleted: (at player-07 pos-20-02) (at stone-06 pos-19-03) (clear pos-18-04)
   added: (at player-07 pos-19-03) (at stone-06 pos-18-04) (clear pos-20-02) (at-goal stone-06)
   goals met: 6 of 8
11. (move player-02 pos-06-02 pos-04-02 dir-west)
   deleted: (at player-02 pos-06-02) (clear pos-04-02)
   added: (at player-02 pos-04-02) (clear pos-06-02)
   goals met: 6 of 8
12. (move player-03 pos-08-02 pos-06-02 dir-west)
   deleted: (at player-03 pos-08-02) (clear pos-06-02)
   added: (at player-03 pos-06-02) (clear pos-08-02)
   goals met: 6 of 8
13. (move player-07 pos-19-03 pos-20-02 dir-northeast)
   deleted: (at player-07 pos-19-03) (clear pos-20-02)
   added: (at player-07 pos-20-02) (clear pos-19-03)
   goals met: 6 of 8
14. (push-to-nongoal player-17 stone-06 pos-17-05 pos-18-04 pos-19-03 dir-northeast)
   deleted: (at player-17 pos-17-05) (at stone-06 pos-18-04) (clear pos-19-03) (at-goal stone-06)
   added: (at player-17 pos-18-04) (at stone-06 pos-19-03) (clear pos-17-05)
   goals met: 5 of 8
15. (move player-17 pos-18-04 pos-17-05 dir-southwest)
   deleted: (at player-17 pos-18-04) (clear pos-17-05)
   added: (at player-17 pos-17-05) (clear pos-18-04)
   goals met: 5 of 8
16. (push-to-goal player-12 stone-08 pos-14-04 pos-16-04 pos-18-04 dir-east)
   deleted: (at player-12 pos-14-04) (at stone-08 pos-16-04) (clear pos-18-04)
   added: (at player-12 pos-16-04) (at stone-08 pos-18-04) (clear pos-14-04) (at-goal stone-08)
   goals met: 6 of 8
17. (push-to-nongoal player-05 stone-05 pos-16-02 pos-15-03 pos-14-04 dir-southwest)
   deleted: (at player-05 pos-16-02) (at stone-05 pos-15-03) (clear pos-14-04) (at-goal stone-05)
   added: (at player-05 pos-15-03) (at stone-05 pos-14-04) (clear pos-16-02)
   goals met: 5 of 8
18. (move player-05 pos-15-03 pos-16-02 dir-northeast)
   deleted: (at player-05 pos-15-03) (clear pos-16-02)
   added: (at player-05 pos-16-02) (clear pos-15-03)
   goals met: 5 of 8
19. (move player-12 pos-16-04 pos-15-03 dir-northwest)
   deleted: (at player-12 pos-16-04) (clear pos-15-03)
   added: (at player-12 pos-15-03) (clear pos-16-04)
   goals met: 5 of 8
20. (push-to-nongoal player-13 stone-08 pos-20-04 pos-18-04 pos-16-04 dir-west)
   deleted: (at player-13 pos-20-04) (at stone-08 pos-18-04) (clear pos-16-04) (at-goal stone-08)
   added: (at player-13 pos-18-04) (at stone-08 pos-16-04) (clear pos-20-04)
   goals met: 4 of 8
21. (move player-13 pos-18-04 pos-20-04 dir-east)
   deleted: (at player-13 pos-18-04) (clear pos-20-04)
   added: (at player-13 pos-20-04) (clear pos-18-04)
   goals met: 4 of 8
22. (move player-17 pos-17-05 pos-18-04 dir-northeast)
   deleted: (at player-17 pos-17-05) (clear pos-18-04)
   added: (at player-17 pos-18-04) (clear pos-17-05)
   goals met: 4 of 8
23. (move player-16 pos-15-05 pos-17-05 dir-east)
   deleted: (at player-16 pos-15-05) (clear pos-17-05)
   added: (at player-16 pos-17-05) (clear pos-15-05)
   goals met: 4 of 8
24. (move player-11 pos-13-05 pos-15-05 dir-east)
   deleted: (at player-11 pos-13-05) (clear pos-15-05)
   added: (at player-11 pos-15-05) (clear pos-13-05)
   goals met: 4 of 8
25. (push-to-goal player-12 stone-05 pos-15-03 pos-14-04 pos-13-05 dir-southwest)
   deleted: (at player-12 pos-15-03) (at stone-05 pos-14-04) (clear pos-13-05)
   added: (at player-12 pos-14-04) (at stone-05 pos-13-05) (clear pos-15-03) (at-goal stone-05)
   goals met: 5 of 8
26. (push-to-goal player-16 stone-08 pos-17-05 pos-16-04 pos-15-03 dir-northwest)
   deleted: (at player-16 pos-17-05) (at stone-08 pos-16-04) (clear pos-15-03)
   added: (at player-16 pos-16-04) (at stone-08 pos-15-03) (clear pos-17-05) (at-goal stone-08)
   goals met: 6 of 8
27. (move player-17 pos-18-04 pos-17-05 dir-southwest)
   deleted: (at player-17 pos-18-04) (clear pos-17-05)
   added: (at player-17 pos-17-05) (clear pos-18-04)
   goals met: 6 of 8
28. (push-to-goal player-07 stone-06 pos-20-02 pos-19-03 pos-18-04 dir-southwest)
   deleted: (at player-07 pos-20-02) (at stone-06 pos-19-03) (clear pos-18-04)
   added: (at player-07 pos-19-03) (at stone-06 pos-18-04) (clear pos-20-02) (at-goal stone-06)
   goals met: 7 of 8
29. (move player-03 pos-06-02 pos-08-02 dir-east)
   deleted: (at player-03 pos-06-02) (clear pos-08-02)
   added: (at player-03 pos-08-02) (clear pos-06-02)
   goals met: 7 of 8
30. (move player-01 pos-05-03 pos-06-02 dir-northeast)
   deleted: (at player-01 pos-05-03) (clear pos-06-02)
   added: (at player-01 pos-06-02) (clear pos-05-03)
   goals met: 7 of 8
31. (push-to-nongoal player-14 stone-01 pos-07-05 pos-06-04 pos-05-03 dir-northwest)
   deleted: (at player-14 pos-07-05) (at stone-01 pos-06-04) (clear pos-05-03) (at-goal stone-01)
   added: (at player-14 pos-06-04) (at stone-01 pos-05-03) (clear pos-07-05)
   goals met: 6 of 8
32. (move player-14 pos-06-04 pos-07-05 dir-southeast)
   deleted: (at player-14 pos-06-04) (clear pos-07-05)
   added: (at player-14 pos-07-05) (clear pos-06-04)
   goals met: 6 of 8
33. (move player-07 pos-19-03 pos-20-02 dir-northeast)
   deleted: (at player-07 pos-19-03) (clear pos-20-02)
   added: (at player-07 pos-20-02) (clear pos-19-03)
   goals met: 6 of 8
34. (push-to-goal player-09 stone-07 pos-10-04 pos-08-04 pos-06-04 dir-west)
   deleted: (at player-09 pos-10-04) (at stone-07 pos-08-04) (clear pos-06-04)
   added: (at player-09 pos-08-04) (at stone-07 pos-06-04) (clear pos-10-04) (at-goal stone-07)
   goals met: 7 of 8
35. (push-to-nongoal player-03 stone-02 pos-08-02 pos-09-03 pos-10-04 dir-southeast)
   deleted: (at player-03 pos-08-02) (at stone-02 pos-09-03) (clear pos-10-04) (at-goal stone-02)
   added: (at player-03 pos-09-03) (at stone-02 pos-10-04) (clear pos-08-02)
   goals met: 6 of 8
36. (move player-03 pos-09-03 pos-08-02 dir-northwest)
   deleted: (at player-03 pos-09-03) (clear pos-08-02)
   added: (at player-03 pos-08-02) (clear pos-09-03)
   goals met: 6 of 8
37. (move player-09 pos-08-04 pos-09-03 dir-northeast)
   deleted: (at player-09 pos-08-04) (clear pos-09-03)
   added: (at player-09 pos-09-03) (clear pos-08-04)
   goals met: 6 of 8
38. (push-to-nongoal player-08 stone-07 pos-04-04 pos-06-04 pos-08-04 dir-east)
   deleted: (at player-08 pos-04-04) (at stone-07 pos-06-04) (clear pos-08-04) (at-goal stone-07)
   added: (at player-08 pos-06-04) (at stone-07 pos-08-04) (clear pos-04-04)
   goals met: 5 of 8
39. (move player-08 pos-06-04 pos-04-04 dir-west)
   deleted: (at player-08 pos-06-04) (clear pos-04-04)
   added: (at player-08 pos-04-04) (clear pos-06-04)
   goals met: 5 of 8
40. (push-to-goal player-02 stone-01 pos-04-02 pos-05-03 pos-06-04 dir-southeast)
   deleted: (at player-02 pos-04-02) (at stone-01 pos-05-03) (clear pos-06-04)
   added: (at player-02 pos-05-03) (at stone-01 pos-06-04) (clear pos-04-02) (at-goal stone-01)
   goals met: 6 of 8
41. (push-to-nongoal player-17 stone-06 pos-17-05 pos-18-04 pos-19-03 dir-northeast)
   deleted: (at player-17 pos-17-05) (at stone-06 pos-18-04) (clear pos-19-03) (at-goal stone-06)
   added: (at player-17 pos-18-04) (at stone-06 pos-19-03) (clear pos-17-05)
   goals met: 5 of 8
42. (move player-11 pos-15-05 pos-17-05 dir-east)
   deleted: (at player-11 pos-15-05) (clear pos-17-05)
   added: (at player-11 pos-17-05) (clear pos-15-05)
   goals met: 5 of 8
43. (push-to-nongoal player-10 stone-05 pos-11-05 pos-13-05 pos-15-05 dir-east)
   deleted: (at player-10 pos-11-05) (at stone-05 pos-13-05) (clear pos-15-05) (at-goal stone-05)
   added: (at player-10 pos-13-05) (at stone-05 pos-15-05) (clear pos-11-05)
   goals met: 4 of 8
44. (push-to-goal player-09 stone-02 pos-09-03 pos-10-04 pos-11-05 dir-southeast)
   deleted: (at player-09 pos-09-03) (at stone-02 pos-10-04) (clear pos-11-05)
   added: (at player-09 pos-10-04) (at stone-02 pos-11-05) (clear pos-09-03) (at-goal stone-02)
   goals met: 5 of 8
45. (move player-09 pos-10-04 pos-09-03 dir-northwest)
   deleted: (at player-09 pos-10-04) (clear pos-09-03)
   added: (at player-09 pos-09-03) (clear pos-10-04)
   goals met: 5 of 8
46. (move player-15 pos-09-05 pos-10-04 dir-northeast)
   deleted: (at player-15 pos-09-05) (clear pos-10-04)
   added: (at player-15 pos-10-04) (clear pos-09-05)
   goals met: 5 of 8
47. (push-to-nongoal player-10 stone-02 pos-13-05 pos-11-05 pos-09-05 dir-west)
   deleted: (at player-10 pos-13-05) (at stone-02 pos-11-05) (clear pos-09-05) (at-goal stone-02)
   added: (at player-10 pos-11-05) (at stone-02 pos-09-05) (clear pos-13-05)
   goals met: 4 of 8
48. (push-to-goal player-11 stone-05 pos-17-05 pos-15-05 pos-13-05 dir-west)
   deleted: (at player-11 pos-17-05) (at stone-05 pos-15-05) (clear pos-13-05)
   added: (at player-11 pos-15-05) (at stone-05 pos-13-05) (clear pos-17-05) (at-goal stone-05)
   goals met: 5 of 8
49. (move player-01 pos-06-02 pos-04-02 dir-west)
   deleted: (at player-01 pos-06-02) (clear pos-04-02)
   added: (at player-01 pos-04-02) (clear pos-06-02)
   goals met: 5 of 8
50. (move player-03 pos-08-02 pos-06-02 dir-west)
   deleted: (at player-03 pos-08-02) (clear pos-06-02)
   added: (at player-03 pos-06-02) (clear pos-08-02)
   goals met: 5 of 8
51. (move player-09 pos-09-03 pos-08-02 dir-northwest)
   deleted: (at player-09 pos-09-03) (clear pos-08-02)
   added: (at player-09 pos-08-02) (clear pos-09-03)
   goals met: 5 of 8
52. (push-to-goal player-14 stone-07 pos-07-05 pos-08-04 pos-09-03 dir-northeast)
   deleted: (at player-14 pos-07-05) (at stone-07 pos-08-04) (clear pos-09-03)
   added: (at player-14 pos-08-04) (at stone-07 pos-09-03) (clear pos-07-05) (at-goal stone-07)
   goals met: 6 of 8
53. (move player-17 pos-18-04 pos-17-05 dir-southwest)
   deleted: (at player-17 pos-18-04) (clear pos-17-05)
   added: (at player-17 pos-17-05) (clear pos-18-04)
   goals met: 6 of 8
54. (push-to-goal player-07 stone-06 pos-20-02 pos-19-03 pos-18-04 dir-southwest)
   deleted: (at player-07 pos-20-02) (at stone-06 pos-19-03) (clear pos-18-04)
   added: (at player-07 pos-19-03) (at stone-06 pos-18-04) (clear pos-20-02) (at-goal stone-06)
   goals met: 7 of 8
55. (move player-14 pos-08-04 pos-07-05 dir-southwest)
   deleted: (at player-14 pos-08-04) (clear pos-07-05)
   added: (at player-14 pos-07-05) (clear pos-08-04)
   goals met: 7 of 8
56. (move player-15 pos-10-04 pos-08-04 dir-west)
   deleted: (at player-15 pos-10-04) (clear pos-08-04)
   added: (at player-15 pos-08-04) (clear pos-10-04)
   goals met: 7 of 8
57. (move player-10 pos-11-05 pos-10-04 dir-northwest)
   deleted: (at player-10 pos-11-05) (clear pos-10-04)
   added: (at player-10 pos-10-04) (clear pos-11-05)
   goals met: 7 of 8
58. (push-to-goal player-14 stone-02 pos-07-05 pos-09-05 pos-11-05 dir-east)
   deleted: (at player-14 pos-07-05) (at stone-02 pos-09-05) (clear pos-11-05)
   added: (at player-14 pos-09-05) (at stone-02 pos-11-05) (clear pos-07-05) (at-goal stone-02)
   goals met: 8 of 8
